app/views/sharenotes/_shownote.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <td><%= #note.note.try(:user).try(:username)
                 User.find(note.user_id).username %></td>