app/controllers/notes_controller.rb

  def index
    # @n = Note.where(user_id: current_user.id, status: false).all
    @notes = Note.includes(:taggings).where(
      user_id: current_user.id, status: false
    ).order('created_at DESC')
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."status" = ? ORDER BY created_at DESC  [["user_id", 1], ["status", 0]]

  def create
    @notes = Note.all
    @note = Note.create(note_params)
---
INSERT INTO "notes" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Orientation"], ["description", "<p>English Class</p>"], ["user_id", 1], ["created_at", "2019-03-11 12:25:05.469548"], ["updated_at", "2019-03-11 12:25:05.469548"]]

  def show
    # @note = Note.find_by_id(params[:id])
    @related_notes = @note.find_related_tags
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('funny') OR LOWER(name) = LOWER('easy'))

  def autosave
    @user = User.find_by(id: current_user.id)
    @user.update(autosave: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "autosave" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["autosave", 1], ["updated_at", "2019-03-11 12:24:50.009003"], ["id", 1]]

  def noautosave
    @user = User.find_by(id: current_user.id)
    @user.update(autosave: false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "autosave" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["autosave", 0], ["updated_at", "2019-03-11 12:24:51.734478"], ["id", 1]]