app/controllers/sharenotes_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @sharenote = Sharenote.new
    @note = Note.find_by(id: params[:note_id])

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "sharenotes" ("email", "user_id", "note_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "ssa@narola.email"], ["user_id", 1], ["note_id", 1], ["created_at", "2019-03-11 12:26:49.409579"], ["updated_at", "2019-03-11 12:26:49.409579"]]
SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "ssa@narola.email"]]
---
  def create
    @note = Note.find_by(id: params[:note_id])
    @user = current_user.email
    @shemail = params[:sharenote][:email]
    @sharenote = @note.sharenotes.create(sharenote_params)

    if User.where(email: params[:sharenote][:email]).present?

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def editaccess
    @note = Note.find_by(id: params[:id])
    # render plain: @note.inspect
    # return
    @user = current_user.email
    @sendto = User.find(@note.user_id).email

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sharenotes".* FROM "sharenotes" WHERE "sharenotes"."id" = ?  [["id", 1]]
UPDATE "sharenotes" SET "edit" = ?, "updated_at" = ? WHERE "sharenotes"."id" = ?  [["edit", 1], ["updated_at", "2019-03-11 12:28:22.261615"], ["id", 1]]
---
  def updatepermission
    @note = Note.find_by(id: params[:id])
    # @sharenotes = @note.sharenotes.where(note_id: @note)
    @sharenote = Sharenote.where(id: @note)
    @sharenote.update(edit: true)